In [1]:
import pandas as pd

In [2]:
series = pd.Series(["honda", "toyota", "benze"])
series

0     honda
1    toyota
2     benze
dtype: object

In [3]:
colour = pd.Series(["red", "black", "white"])
colour

0      red
1    black
2    white
dtype: object

In [4]:
price = pd.Series([1000, 30000, 70000])

In [5]:
d = pd.DataFrame({"cars":series, "colour":colour, "price":price})
d

     cars colour  price
0   honda    red   1000
1  toyota  black  30000
2   benze  white  70000

In [6]:
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [7]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [8]:
car_sales["Odometer (KM)"].dtype

dtype('int64')

In [9]:
car_sales["Price"] = car_sales["Price"].str.replace('$', '').str.replace(',', '').astype(float).astype(int)

In [10]:
car_sales

     Make Colour  Odometer (KM)  Doors  Price
0  Toyota  White         150043      4   4000
1   Honda    Red          87899      4   5000
2  Toyota   Blue          32549      3   7000
3     BMW  Black          11179      5  22000
4  Nissan  White         213095      4   3500
5  Toyota  Green          99213      4   4500
6   Honda   Blue          45698      4   7500
7   Honda   Blue          54738      4   7000
8  Toyota  White          60000      4   6250
9  Nissan  White          31600      4   9700

## converting images to numpy array

In [11]:
<img src="numpy-panda.png" />

SyntaxError: invalid syntax (245121368.py, line 1)